{
  "event_types": {
    "lecture_or_talk": {
      "description": "A talk, lecture, or presentation the student attended",
      "typical_experiences": [
        "Found one specific topic or subtopic within the talk more engaging than the rest",
        "Had a moment where something the speaker explained clicked a concept into place",
        "Connected something from the talk to a patient or case seen on placement",
        "Found a particular comparison, framework, or classification helpful",
        "Seeing a specialist's perspective vs textbook learning landed differently",
        "Left with a question they want to look into further"
      ],
      "thought_seeds": [
        "What specific part of the content was new vs. what you already knew?",
        "Was there a moment where something abstract became concrete?",
        "What's one thing you'd explain differently after hearing this?",
        "Did any part contradict or complicate what you'd read in textbooks?",
        "What would you actually tell a coursemate about this talk?"
      ]
    },
    "conference": {
      "description": "A multi-session conference or symposium",
      "typical_experiences": [
        "One talk stood out more than others",
        "Met other students or professionals with similar interests",
        "The variety of topics gave a broader perspective on the field",
        "A case presentation or panel discussion was particularly memorable",
        "Earned CPD points which felt like a tangible marker of development",
        "The Q&A sessions added depth beyond the prepared presentations"
      ],
      "thought_seeds": [
        "Which session stuck with you and why that one specifically?",
        "Did anything challenge the way you'd been thinking about the field?",
        "What was the gap between what you expected and what you got?",
        "Was there a question from the audience that changed the discussion?",
        "What would you look up or read next based on what you heard?"
      ]
    },
    "workshop_or_practical": {
      "description": "Hands-on workshop, skills session, or practical training",
      "typical_experiences": [
        "Practised a specific technique and noticed improvement by the end",
        "Found one aspect harder than expected",
        "Got feedback from an instructor that was useful",
        "The hands-on element made a concept click that was abstract in lectures",
        "Felt more confident in the skill afterwards"
      ],
      "thought_seeds": [
        "What was harder than you expected going in?",
        "What clicked when you actually did it vs. just reading about it?",
        "Was there a specific moment where you noticed yourself improving?",
        "What would you do differently if you repeated the exercise?",
        "What's the gap between knowing the theory and doing the thing?"
      ]
    },
    "volunteering_mock_interviews": {
      "description": "Volunteering at mock MMIs or interview practice for applicants",
      "typical_experiences": [
        "Being on the interviewer side gave a new perspective on the process",
        "Noticed common patterns in how applicants approached stations",
        "Reflected on their own MMI experience and how they'd approach it now",
        "Saw an applicant visibly improve across stations",
        "Realised how much they've grown since being an applicant themselves",
        "Gave specific feedback that seemed to land"
      ],
      "thought_seeds": [
        "What surprised you about being on the assessor side vs. being assessed?",
        "Did you catch yourself wanting to help candidates instead of assess them?",
        "What patterns did you notice in how people handle the ethical stations?",
        "How would you approach your own MMI differently knowing what you know now?",
        "What was the most common thing candidates struggled with?"
      ]
    },
    "volunteering_outreach": {
      "description": "Volunteering for outreach, widening participation, or teaching applicants",
      "typical_experiences": [
        "Helped applicants with a specific part of the process (personal statements, interview prep, etc.)",
        "Answered questions that reminded them of their own application anxieties",
        "Noticed how driven and motivated the applicants were",
        "Felt good about supporting the pipeline that supported them",
        "Learned something about teaching or communication through the experience"
      ],
      "thought_seeds": [
        "What questions did applicants ask that you hadn't thought about in a while?",
        "Did explaining something to an applicant make you understand it differently?",
        "What do you remember about being in their position?",
        "What's the most useful thing someone told you when you were applying?",
        "Was there a moment where you realised how far you've come?"
      ]
    },
    "volunteering_charity": {
      "description": "Volunteering for a charity or community initiative",
      "typical_experiences": [
        "Found the non-clinical side of healthcare meaningful",
        "Connected with other volunteers over shared motivation",
        "Did something creative or personal rather than academic for a change",
        "Thought about the patient experience beyond treatment",
        "Found it grounding to step outside the academic bubble"
      ],
      "thought_seeds": [
        "What was it actually like doing this, practically speaking?",
        "Did anything about the experience feel different from what you expected?",
        "What did you notice about the people you were doing this for?",
        "What's the thing about this that you'd actually remember?",
        "Was there a moment of uncertainty about what to do or say?"
      ]
    },
    "hackathon": {
      "description": "A hackathon, innovation challenge, or collaborative problem-solving event",
      "typical_experiences": [
        "Worked intensely with a team under time pressure",
        "Had to scope down an ambitious idea to something buildable",
        "Found the interdisciplinary aspect refreshing compared to clinical study",
        "Presented a solution to judges or other teams",
        "Learned something about teamwork, rapid prototyping, or pitching"
      ],
      "thought_seeds": [
        "What did your team's original idea look like vs. what you actually built?",
        "What was the hardest constraint — time, skills, or scope?",
        "Did working with people from different backgrounds change your approach?",
        "What would you do differently if you had another day?",
        "What surprised you about the problem once you dug into it?"
      ]
    },
    "webinar": {
      "description": "An online webinar or virtual session",
      "typical_experiences": [
        "Convenient to attend remotely, fitted around other commitments",
        "The Q&A or chat added perspectives from other attendees",
        "Took notes on one or two key points to revisit later",
        "The format made it easy to fit into a packed schedule"
      ],
      "thought_seeds": [
        "What's the one thing from this you'd actually look up afterwards?",
        "Did the Q&A or chat surface anything the speaker hadn't covered?",
        "What part of this was most relevant to where you are in training right now?",
        "Was there a specific recommendation or resource worth following up on?"
      ]
    }
  }
}
